In [1]:
import pandas as pd

In [2]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")

## The `pd.concat()` Method, Part 1

In [3]:
len(week1)

250

In [4]:
len(week2)

250

In [5]:
pd.concat(objs = [week1, week2])
pd.concat(objs = [week1, week2], ignore_index= False )
pd.concat(objs = [week1, week2], ignore_index= True )# use if the the index is not important

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [10]:
len(pd.concat([week1, week2]))

500

## The `pd.concat()` Method, Part 2

In [7]:
sales = pd.concat([week1, week2], keys = ["A", "B"])

In [8]:
sales.loc[("B", 240), "Customer ID"]

734

## Inner Joins, Part 1
Merges two datasets based on commonly shared values

In [9]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")

In [10]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [11]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [16]:
week1.merge(week2, how = "inner", on = "Customer ID",suffixes = [" - Week 1", " - Week 2"]) #beware of duplication of value, look at customer id 155

    Customer ID  Food ID - Week 1  Food ID - Week 2
0           537                 9                 5
1           155                 9                 3
2           155                 1                 3
3           503                 5                 8
4           503                 5                 9
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

In [14]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [15]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

## Inner Joins, Part 2

In [17]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")

In [18]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [19]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [20]:
week1.merge(week2, how = "inner", on = ["Customer ID", "Food ID"])  #pull dataframe of customers who came in on week 1 and week 2 and also ordered the exact same food item on both week 1 and week 2

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [21]:
week1[week1["Customer ID"] == 578]
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [22]:
week2[week2["Customer ID"] == 578]
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

## Outer Joins
Combines values that are found in either dataframe or both

In [23]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [24]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [26]:
merged =  week1.merge(week2, how = "outer", on = "Customer ID", suffixes = [" - Week 1", " - Week 2"],
            indicator = True)

In [27]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [28]:
mask = merged["_merge"].isin(["left_only", "right_only"])
merged[mask]

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
6            213               8.0               NaN   left_only
7            600               1.0               NaN   left_only
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[392 rows x 4 columns]

## Left Joins
look at values in data frame on the left and see if they exist in data frame on the right think in terms of Venn Diagrams

In [29]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")

In [30]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [31]:
foods.head(3)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99
2        3      Taco   2.99

In [32]:
week1 = week1.merge(foods, how = "left", on = "Food ID", sort = True) # sorts on food ID

In [34]:
week1.head(15)

    Customer ID  Food ID Food Item  Price
0           658        1     Sushi   3.99
1           600        1     Sushi   3.99
2           155        1     Sushi   3.99
3           341        1     Sushi   3.99
4            20        1     Sushi   3.99
5            77        1     Sushi   3.99
6           100        1     Sushi   3.99
7           953        1     Sushi   3.99
8           504        1     Sushi   3.99
9           323        1     Sushi   3.99
10          922        1     Sushi   3.99
11          909        1     Sushi   3.99
12          602        1     Sushi   3.99
13           74        1     Sushi   3.99
14          703        1     Sushi   3.99

## The `left_on` and `right_on` Parameters
Use when we don't have matching columns names

In [35]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")

In [36]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [37]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [38]:
week2 = week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID", sort = True).drop("ID", axis = "columns") # use when I don't have matching columns on the dataframe.

In [39]:
week2.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive

## Merging by Indexes with the `left_index` and `right_index` Parameters

In [44]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv", index_col = "ID")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv", index_col= "Food ID")

In [45]:
customers.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [47]:
sales = week1.merge(customers, how = "left", left_on = "Customer ID", right_index = True)
sales = sales.merge(foods, how = "left", left_on = "Food ID", right_index = True)
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

In [48]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [49]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [50]:
week1.merge(week2, how = "left", left_index = True, right_index = True, suffixes = [" - Week 1", " - Week 2"])

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10
3,202,2,189,5
4,155,9,267,3
...,...,...,...,...
245,413,9,783,10
246,926,6,556,10
247,134,3,547,9
248,396,6,252,9
249,535,10,249,6

## The `.join()` Method

In [51]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")
satisfaction = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Satisfaction.csv")

In [52]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [53]:
satisfaction.head(3)

   Satisfaction Rating
0                    2
1                    7
2                    3

In [54]:
week1.merge(satisfaction, how = "left", left_index = True, right_index = True).head() # An alternative method

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

In [55]:
week1.join(satisfaction).head() # Easier method

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

## The `pd.merge()` Method

In [56]:
week1 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 2 Sales.csv")
customers = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Customers.csv")
foods = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Foods.csv")
satisfaction = pd.read_csv(r"C:\Users\Gebruiker\Documents\Python Scripts\notebooks_udemy_course\pandas\Restaurant - Week 1 Satisfaction.csv")

In [57]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [58]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [59]:
pd.merge(week1, customers, how = "left", left_on = "Customer ID", right_on = "ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...,...
245,413,9,413,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,926,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,134,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,396,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,535,Nancy,Cox,Female,Trudeo,Research Associate